meeting/agenda/2024/07-16.org
:PROPERTIES:
:ID:       A7A7E4D7-89C8-42F5-994A-5E1977E1DE23
:END:
#+title: QT4 CG Meeting 086 Agenda 2024-07-16
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Agenda index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00BST (15:00GMT, 17:00CEST, 11:00EDT) 

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2024/07-09.html][the previous meeting]].

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

This meeting is planned for 16 July. The following meeting is scheduled for
23 July.

The CG will meet on 23 July but will then take a summer recess with no
meetings from 30 July to 27 August, inclusive. We’ll start up again on 3
September.

** Review of open action items [0/3]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [ ] QT4CG-080-05: NW to add absolute property to the parse-uri output
+ [ ] QT4CG-080-07: NW to update the build instructions in the README
+ [ ] QT4CG-082-02: DN to work with MK to come to agreement on the fn:ranks proposal

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

*** Blocked
:PROPERTIES:
:CUSTOM_ID: blocked
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-1231][#1231]]: 1193 Parsing Functions: Empty input
+ PR [[https://qt4cg.org/dashboard/#pr-1227][#1227]]: 150 PR resubmission for fn ranks
+ PR [[https://qt4cg.org/dashboard/#pr-1062][#1062]]: 150bis - revised proposal for fn:ranks
+ PR [[https://qt4cg.org/dashboard/#pr-529][#529]]: 528 fn:elements-to-maps

*** Close without action
:PROPERTIES:
:CUSTOM_ID: close-without-action
:END:

It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1272][#1272]]: Add xsl:value-of/@as attribute

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-1296][#1296]]: 982 Rewrite of scan-left and scan-right
+ PR [[https://qt4cg.org/dashboard/#pr-1283][#1283]]: 77b: Update expressions
+ PR [[https://qt4cg.org/dashboard/#pr-1266][#1266]]: 1158 Add array mapping operator
+ PR [[https://qt4cg.org/dashboard/#pr-1263][#1263]]: 1224 Add xsl:accumulator-rule/@priority attribute
+ PR [[https://qt4cg.org/dashboard/#pr-1244][#1244]]: 566-partial Rewrite parse-uri
+ PR [[https://qt4cg.org/dashboard/#pr-1228][#1228]]: – Adding the BLAKE3 hashing algorithm to fn:hash
+ PR [[https://qt4cg.org/dashboard/#pr-1209][#1209]]: 1183 Add transient mode and the transient{} expression
+ PR [[https://qt4cg.org/dashboard/#pr-1185][#1185]]: 1179 array:values, map:values → array:get, map:get
+ PR [[https://qt4cg.org/dashboard/#pr-832][#832]]: 77 Lookup returning path selection

*** Required for V4.0
:PROPERTIES:
:CUSTOM_ID: required-40
:END:

The following issues are labeled “required for V4.0”.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1252][#1252]]: Add a new function `fn:html-doc`
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1240][#1240]]: $sequence-of-maps ? info()
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1238][#1238]]: XSLT on-no-match="shallow-copy-all" - revised rules
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1235][#1235]]: Function Identity: Treating function items with identical bodies
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1202][#1202]]: XQFO: Rendering of new/updated functions
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1169][#1169]]: Maps & Arrays: Consistency & Terminology
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1127][#1127]]: Binary resources
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1045][#1045]]: Functions to manage namespace usage
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1021][#1021]]: Extend `fn:doc`, `fn:collection` and `fn:uri-collection` with options maps
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1014][#1014]]: Predicates, sequences of numbers: Feedback
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1011][#1011]]: fn:transform() improvements
+ Issue [[https://github.com/qt4cg/qtspecs/issues/986][#986]]: Numeric Comparisons
+ Issue [[https://github.com/qt4cg/qtspecs/issues/967][#967]]: XPath Appendix I: Comparisons
+ Issue [[https://github.com/qt4cg/qtspecs/issues/868][#868]]: fn:intersperse → fn:join, array:join($arrays, $separator)
+ Issue [[https://github.com/qt4cg/qtspecs/issues/826][#826]]: Arrays: Representation of single members of an array
+ Issue [[https://github.com/qt4cg/qtspecs/issues/767][#767]]: parse-html(): case of SVG element names
+ Issue [[https://github.com/qt4cg/qtspecs/issues/755][#755]]: Expression for binding the Context Value
+ Issue [[https://github.com/qt4cg/qtspecs/issues/748][#748]]: Parse functions: consistency
+ Issue [[https://github.com/qt4cg/qtspecs/issues/689][#689]]: fn:stack-trace: keep, drop, replace with $err:stack-trace ?
+ Issue [[https://github.com/qt4cg/qtspecs/issues/675][#675]]: XSLT streaming rules for new constructs
+ Issue [[https://github.com/qt4cg/qtspecs/issues/501][#501]]: Error handling: Rethrow errors; finally block
+ Issue [[https://github.com/qt4cg/qtspecs/issues/490][#490]]: Control over schema validation in parse-xml(), doc(), etc.
+ Issue [[https://github.com/qt4cg/qtspecs/issues/407][#407]]: XSLT-specific context properties used in function items
+ Issue [[https://github.com/qt4cg/qtspecs/issues/272][#272]]: Setting parameter values in xsl:use-package
+ Issue [[https://github.com/qt4cg/qtspecs/issues/69][#69]]: fn:document, fn:function-available: default arguments

* Technical Agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** Community, communication, and consensus
:PROPERTIES:
:CUSTOM_ID: communication
:END:

Can we make our process less…fractious?

When a working group cannot discuss issues in an open, candid manner with mutal
respect and understanding, it begins to break down. Let’s take a few minutes to
reassure each other that we’re all on the same side here.

Some proposals succeed, some fail. Some issues are taken up in earnest, some
languish. Sometimes the merits of our arguments are immediately recognized,
sometimes they fall on deaf ears. Sometimes unanimity can be achieved, sometimes
it cannot.

When unanimity cannot be achieved, we attempt to operate on the basis of “rough
consensus”. If there’s a clear majority opinion, we choose to adopt that as the
status quo. That doesn’t mean an issue cannot be revisited, that new information
cannot arise which persuades us to change our minds, but it offers us a way to
make incremental progress towards our goal.

If you find yourself in the majority, remember that the minority are smart and
capable and arguing in good faith. That they have not been persuaded should be
cause for sincere reflection. If you find yourself in the minority, remember
that the majority are smart and capable and arguing in good faith. If your
technical arguments were unpersuasive, repeating them more stridently with more
dramatic metaphors isn’t likely to be persuasive either. Sometimes working
groups make decisions that some individuals think are A Very Bad Idea™. There
comes a point at which the most productive thing the minority can do is accept the
decision with the understanding that the objections have been heard and recorded.

** PR #1296: 982 Rewrite of scan-left and scan-right
:PROPERTIES:
:CUSTOM_ID: pr-1296
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1296][#1296]]

Let’s try to pick this up where we left off and see if we can come to consensus.
Please review the [[../../minutes/2024/07-09.html#pr-1296][minutes of the previous meeting]] before we continue this discussion.

** PR #1283: 77b: Update expressions
:PROPERTIES:
:CUSTOM_ID: pr-1283
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1283][#1283]]


** PR #1263: 1224 Add xsl:accumulator-rule/@priority attribute
:PROPERTIES:
:CUSTOM_ID: pr-1263
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1263][#1263]]
** PR #1228: – Adding the BLAKE3 hashing algorithm to fn:hash
:PROPERTIES:
:CUSTOM_ID: pr-1228
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1228][#1228]]
** PR #1209: 1183 Add transient mode and the transient{} expression
:PROPERTIES:
:CUSTOM_ID: pr-1209
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1209][#1209]]
** PR #1185: 1179 array:values, map:values → array:get, map:get
:PROPERTIES:
:CUSTOM_ID: pr-1185
:END:
See PR [[https://qt4cg.org/dashboard/#pr-1185][#1185]]

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:
